{"format": "layers-model", "generatedBy": "keras v3.3.3", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.3.3", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_3", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_layer_3"}, "name": "input_layer_3", "inbound_nodes": []}, {"class_name": "Rescaling", "config": {"name": "rescaling_1", "trainable": true, "dtype": "float32", "scale": 0.00784313725490196, "offset": -1}, "name": "rescaling_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 224, 224, 3], "dtype": "float32", "keras_history": ["input_layer_3", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Functional", "config": {"name": "vgg16", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_layer_2"}, "name": "input_layer_2", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 224, 224, 3], "dtype": "float32", "keras_history": ["input_layer_2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block1_conv2", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 224, 224, 64], "dtype": "float32", "keras_history": ["block1_conv1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block1_pool", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 224, 224, 64], "dtype": "float32", "keras_history": ["block1_conv2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block2_conv1", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 112, 112, 64], "dtype": "float32", "keras_history": ["block1_pool", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block2_conv2", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 112, 112, 128], "dtype": "float32", "keras_history": ["block2_conv1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block2_pool", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 112, 112, 128], "dtype": "float32", "keras_history": ["block2_conv2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block3_conv1", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 128], "dtype": "float32", "keras_history": ["block2_pool", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block3_conv2", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 256], "dtype": "float32", "keras_history": ["block3_conv1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block3_conv3", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 256], "dtype": "float32", "keras_history": ["block3_conv2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block3_pool", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 56, 56, 256], "dtype": "float32", "keras_history": ["block3_conv3", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block4_conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 256], "dtype": "float32", "keras_history": ["block3_pool", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block4_conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 512], "dtype": "float32", "keras_history": ["block4_conv1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block4_conv3", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 512], "dtype": "float32", "keras_history": ["block4_conv2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block4_pool", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 28, 28, 512], "dtype": "float32", "keras_history": ["block4_conv3", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block5_conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 512], "dtype": "float32", "keras_history": ["block4_pool", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block5_conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 512], "dtype": "float32", "keras_history": ["block5_conv1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Conv2D", "config": {"name": "block5_conv3", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 512], "dtype": "float32", "keras_history": ["block5_conv2", 0, 0]}}], "kwargs": {}}]}, {"class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block5_pool", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 14, 14, 512], "dtype": "float32", "keras_history": ["block5_conv3", 0, 0]}}], "kwargs": {}}]}, {"class_name": "GlobalMaxPooling2D", "config": {"name": "global_max_pooling2d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_max_pooling2d_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 7, 7, 512], "dtype": "float32", "keras_history": ["block5_pool", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_layer_2", 0, 0]], "output_layers": [["global_max_pooling2d_1", 0, 0]]}, "name": "vgg16", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 224, 224, 3], "dtype": "float32", "keras_history": ["rescaling_1", 0, 0]}}], "kwargs": {"mask": null}}]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 512], "dtype": "float32", "keras_history": ["vgg16", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L1L2", "config": {"l1": 1e-05, "l2": 0.0001}, "registered_name": null}, "bias_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 0.0001}, "registered_name": null}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 512], "dtype": "float32", "keras_history": ["flatten_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "seed": null, "noise_shape": null}, "name": "dropout_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 512], "dtype": "float32", "keras_history": ["dense_5", 0, 0]}}], "kwargs": {"training": false}}]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 512], "dtype": "float32", "keras_history": ["dropout_1", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256], "dtype": "float32", "keras_history": ["dense_6", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128], "dtype": "float32", "keras_history": ["dense_7", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 9, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 32], "dtype": "float32", "keras_history": ["dense_8", 0, 0]}}], "kwargs": {}}]}], "input_layers": [["input_layer_3", 0, 0]], "output_layers": [["dense_9", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 9.999999747378752e-05, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of15.bin", "group1-shard2of15.bin", "group1-shard3of15.bin", "group1-shard4of15.bin", "group1-shard5of15.bin", "group1-shard6of15.bin", "group1-shard7of15.bin", "group1-shard8of15.bin", "group1-shard9of15.bin", "group1-shard10of15.bin", "group1-shard11of15.bin", "group1-shard12of15.bin", "group1-shard13of15.bin", "group1-shard14of15.bin", "group1-shard15of15.bin"], "weights": [{"name": "dense_5/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [256, 128], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [128, 32], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_9/kernel", "shape": [32, 9], "dtype": "float32"}, {"name": "dense_9/bias", "shape": [9], "dtype": "float32"}, {"name": "block4_conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "block4_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv3/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv3/bias", "shape": [512], "dtype": "float32"}, {"name": "block1_conv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "block1_conv1/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "block1_conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "block2_conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "block2_conv1/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "block2_conv2/bias", "shape": [128], "dtype": "float32"}, {"name": "block3_conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "block3_conv1/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv2/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv3/bias", "shape": [256], "dtype": "float32"}]}]}